test/src/test/testtool/EsbSoapWrapperPipe/25/out.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" ><soapenv:Header><MessageHeader xmlns="http://www.ing.com/CSP/xsd/general/message_2">
   <From>
      <Id>Ibis4Tryout</Id>
   </From>
   <HeaderFields>
      <ConversationId>WPNLD9313348_0a4aba76-21410a31_135c41287dc_-7fcb</ConversationId>
      <MessageId>WPNLD9313348_0a4aba76-21410a31_135c41287dc_-7fca</MessageId>
      <Timestamp>2012-02-28T14:07:43</Timestamp>
   </HeaderFields>
</MessageHeader></soapenv:Header><soapenv:Body><CalculationRequest xmlns:SOAPENV="http://schemas.xmlsoap.org/soap/envelope/"
                    xmlns="http://www.frankframework.org/ISS/XSD/NL/LI/ActuarialCalculationsLifeRetail_1_CQAPVLI_1_Req_Rply">
   <Result xmlns="http://www.ing.com/CSP/xsd/general/message_2">
      <Status>ERROR</Status>
      <ErrorList>
         <Error>
            <Code>ERROR1234</Code>
            <Reason/>
            <Service>
               <Name>Document</Name>
               <Context>SalesDocument</Context>
               <Action>
                  <Name>WrapErrorMessage</Name>
                  <Version>1</Version>
               </Action>
            </Service>
            <DetailList>
               <Detail>
                  <Code>errorDetailCode</Code>
                  <Text><![CDATA[errorDetailText]]></Text>
               </Detail>
            </DetailList>
         </Error>
      </ErrorList>
   </Result>
</CalculationRequest></soapenv:Body></soapenv:Envelope>